package com.university.preporation.kolos1.task1;

public class task1 {
    /*Задание: Реализуйте систему управления университетской базой данных, включающую студентов и преподавателей.
     Каждый студент может быть записан на несколько курсов, у каждого курса есть оценки. Преподаватели ведут
      определенные курсы, и у каждого преподавателя есть свой список преподаваемых курсов.
     *  Добавьте методы для добавления/удаления курсов студентам, добавления оценок курсам,
      а также вычисления средней оценки студента. Для преподавателя - курсы, которые они ведут
      (соотвественно добавление преподавателя курса к другим преподавателям и его удаление)
     *   Создайте класс для обработки списка людей в университете. Реализуйте методы для добавления
     студентов и преподавателей, отображения списка курсов и оценок студентов, а также вычисления средней
     оценки по всем студентам.*/
}
